package org.example.hw.block1_4_сonstructors.task2;

/*
1.4.2 Рисуем Линию. Измените сущность Линия из задачи 1.2.1. Необходимо уметь создавать Линии указывая следующие комбинации параметров:
    • Точку начала и Точку конца (Точки из задачи 1.4.1)
    • Четыре числа, соответствующие координатам (x1, y1, x2, y2)
Создайте Линии со следующими характеристиками:
    1. Линия 1 с началом в т. {1;3} и концом в {23;8}.
    2. Линия 2, горизонтальная, на высоте 10, от точки 5 до точки 25.
    3. Линия 3 которая начинается всегда там же где начинается линия 1, и заканчивается всегда там же, где заканчивается линия 2.

 */
public class DrawALine {
    // реализовано в Line и Main4
}
