package org.example.hw.block1_4_сonstructors.task7;

/*

1.4.7 Зачисляем Студента. Измените сущность Студент из задачи 1.3.1.
Необходимо уметь создавать Студента указывая следующие комбинации параметров:
    • Только имя (строковое)
    • Имя (строковое) и набор оценок
Оба способа должны быть реализованы единственным конструктором.
Создайте и выведите на экран следующие объекты:
    1. Студент Вася с оценками: 3,4,5.
    2. Студент Максим без оценок
 */
public class EnrollStudent {
    // реализовано в Student и Main4
}
