package org.example.hw.block1_4_сonstructors.task1;

/*
1.4.1. Ставим Точку. Измените сущность Точка из задачи 1.1.1 В соответствии с новыми
требованиями создать объект Точки можно только путем указания обеих координат: X и Y.
Необходимо выполнить следующие задачи:
    1. Создайте и выведите на экран точку с координатами 3;5
    2. Создайте и выведите на экран точку с координатами 25;6
    3. Создайте и выведите на экран точку с координатами 7;8

   Удален конструктор без аргументов в п.1.1.1., чтобы нельзя
   было создать точку без указания координат.
 */

public class Line_4 {
// реализовано в Point и Main4
}