package org.example.hw.block1_4_сonstructors.task5;

/*
1.4.5 Даем Имена. Измените сущность Имя из задачи 1.1.3. Необходимо уметь создавать Имена указывая следующие комбинации параметров:
    • Только Личное имя
    • Личное имя и Фамилию.
    • Личное имя, Фамилию и Отчество.

Необходимо создать следующие имена:
    1. Клеопатра
    2. Александр Сергеевич Пушкин
    3. Владимир Маяковский
    4. Христофор Бонифатьевич (здесь Христофор это имя, а Бонифатьевич - фамилия)

 */
public class GiveNames {
}
