package org.example.hw.block1_4_сonstructors.task6;

/*
Измените сущность Человек из задачи 1.2.3. Необходимо уметь создавать человека
указывая следующие комбинации параметров:
    • Только имя в виде строки (оно будет считаться за Личное имя).
    • Только имя в виде объекта типа Имя (из задачи 1.4.5)
    • Отца и имя в виде строки
    • Отца и имя в виде объекта типа Имя
Реализуйте описанные способы создания Человека таким образом, чтобы операции присвоения
использовались только в одном из конструкторов.
Создайте и выведите на экран следующие объекты:
    1. Человека с именем Лев (в виде строки)
    2. Человека с именем Пушкин Сергей (как Имя) и отцом Львом (предыдущий Человек)
    3. Человека с именем Александр (в виде строки) и отцом Сергеем (предыдущий Человек)

 */
public class CreatePerson {
    // реализовано в Person и Main4
}
